app/views/url_pairs/index.html.haml


="URL Pair Count: #{UrlPair.count}"
---
SELECT COUNT(*) FROM "url_pairs"