app/controllers/url_pairs_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 13]]
---
 def index
	#@url_pairs = UrlPair.find(:all)
	current_or_guest_user
	id
	@url_pairs = User.find_by_id(@id).url_pairs.all

SELECT "url_pairs".* FROM "url_pairs" WHERE "url_pairs"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
	id
	@url_pair = UrlPair.find(params[:id])

INSERT INTO "url_pairs" ("created_at", "long_url", "short_url", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 08 Jun 2012 05:01:45 UTC +00:00], ["long_url", ""], ["short_url", ""], ["updated_at", Fri, 08 Jun 2012 05:01:45 UTC +00:00], ["user_id", nil]]
---
  def create
	current_or_guest_user
	id
	@url_pair = UrlPair.new(params[:url_pair])
	@url_pair.user_id = @id
	@url_pair.hit_count = 0
	if @url_pair.save

SELECT "url_pairs".* FROM "url_pairs" WHERE "url_pairs"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
	id
	@url_pair = UrlPair.find(params[:id])

SELECT "url_pairs".* FROM "url_pairs" WHERE "url_pairs"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "url_pairs" SET "long_url" = 'http:\\www.google.com', "short_url" = 'http:\\g', "updated_at" = '2012-06-09 00:39:32.945279' WHERE "url_pairs"."id" = 1
---
  def update
	@url_pair = UrlPair.find(params[:id])
	id
	@url_pair.user_id = @id
	if @url_pair.hit_count.nil? || @url_pair.hit_count <= 0
		@url_pair.hit_count = 0
	end
	if @url_pair.update_attributes(params[:url_pair])